let area= {
    "Австралия": "7,692,024 км²",
      "Австрия": "83,879 км²",
      "Азербайджан": "86,600 км²",
      "Албания": "28,748 км²",
      "Алжир": "2,381,741 км²",
      "Ангола": "1,246,700 км²",
      "Андорра": "467,6 км²",
      "Антигуа и Барбуда": "440 км²",
      "Аргентина": "2,780,400 км²",
      "Армения": "29,743 км²",
      "Афганистан": "652,864 км²",
      "Багамские Острова": "13,878 км²",
      "Бангладеш": "147,570 км²",
      "Барбадос": "430 км²",
      "Бахрейн": "760 км²",
      "Беларусь": "207,595 км²",
      "Белиз": "22,966 км²",
      "Бельгия": "30,528 км²",
      "Бенин": "114,763 км²",
      "Болгария": "110,994 км²",
      "Боливия": "1,098,581 км²",
      "Босния и Герцеговина": "51,197 км²",
      "Ботсвана": "581,730 км²",
      "Бразилия": "8,515,767 км²",
      "Бруней": "5,765 км²",
      "Буркина-Фасо": "274,200 км²",
      "Бурунди": "27,834 км²",
      "Бутан": "38,394 км²",
      "Вануату": "12,190 км²",
      "Великобритания": "243,610 км²",
      "Венгрия": "93,030 км²",
      "Венесуэла": "916,445 км²",
      "Восточная Сахара": "266,000 км²",
      "Восточный Тимор": "15,007 км²",
      "Вьетнам": "332,698 км²",
      "Габон": "267,667 км²",
      "Гаити": "27,750 км²",
      "Гайана": "214,970 км²",
      "Гамбия": "10,689 км²",
      "Гана": "238,535 км²",
      "Гватемала": "108,889 км²",
      "Гвинея": "245,836 км²",
      "Гвинея-Бисау": "36,125 км²",
      "Германия": "357,168 км²",
      "Гондурас": "112,492 км²",
      "Гренада": "344 км²",
      "Гренландия": "2,166,086 км²",
      "Греция": "131,957 км²",
      "Грузия": "69,700 км²",
      "Дания": "42,915 км²",
      "Джибути": "23,200 км²",
      "Доминика": "750 км²",
      "Доминиканская Республика": "48,442 км²",
      "Египет": "1,002,450 км²",
      "Замбия": "752,618 км²",
      "Зимбабве": "390,757 км²",
      "Израиль": "20,770 км²",
      "Индия": "3,287,590 км²",
      "Индонезия": "1,904,569 км²",
      "Иордания": "89,342 км²",
      "Ирак": "437,072 км²",
      "Иран": "1,648,195 км²",
      "Ирландия": "84,421 км²",
      "Исландия": "102,775 км²",
      "Испания": "504,645 км²",
      "Италия": "301,338 км²",
      "Йемен": "527,829 км²",
      "Кабо-Верде": "4,033 км²",
      "Казахстан": "2,724,900 км²",
      "Камбоджа": "181,035 км²",
      "Камерун": "475,442 км²",
      "Канада": "9,984,670 км²",
      "Катар": "11,571 км²",
      "Кения": "581,309 км²",
      "Кипр": "9,251 км²",
      "Киргизия": "199,951 км²",
      "Кирибати": "811 км²",
      "Китай": "9,596,961 км²",
      "Колумбия": "1,141,748 км²",
      "Коморы": "2,235 км²",
      "Конго": "342,000 км²",
      "Демократическая Республика Конго": "2,345,409 км²",
      "Коста-Рика": "51,100 км²",
      "Кот-д'Ивуар": "322,463 км²",
      "Куба": "109,884 км²",
      "Кувейт": "17,820 км²",
      "Лаос": "236,800 км²",
      "Латвия": "64,589 км²",
      "Лесото": "30,355 км²",
      "Либерия": "111,369 км²",
      "Ливан": "10,452 км²",
    "Ливия": "1,759,541 км²",
    "Литва": "65,300 км²",
    "Лихтенштейн": "158 км²",
    "Люксембург": "2,586 км²",
    "Маврикий": "2,040 км²",
    "Мавритания": "1,030,700 км²",
    "Мадагаскар": "587,041 км²",
    "Македония": "25,713 км²",
    "Малави": "118,484 км²",
    "Малайзия": "329,847 км²",
    "Мали": "1,240,192 км²",
    "Мальдивы": "297,8 км²",
    "Мальта": "316 км²",
    "Марокко": "446 550 км²",
    "Мартиника": "1,128 км²",
    "Маршалловы Острова": "181 км²",
    "Мексика": "1,972,550 км²",
    "Микронезия": "702 км²",
    "Мозамбик": "801,590 км²",
    "Молдова": "33,846 км²",
    "Монако": "2,02 км²",
    "Монголия": "1,564,116 км²",
    "Мьянма": "676,578 км²",
    "Намибия": "825,615 км²",
    "Науру": "21 км²",
    "Непал": "147,181 км²",
    "Нигер": "1,267,000 км²",
    "Нигерия": "923,768 км²",
    "Нидерланды": "41,543 км²",
    "Никарагуа": "130,375 км²",
    "Ниуэ": "261,5 км²",
    "Новая Зеландия": "268,021 км²",
    "Новая Каледония": "18,576 км²",
    "Норвегия": "385,178 км²",
    "ОАЭ": "83,600 км²",
    "Оман": "309,501 км²",
    "Пакистан": "803,940 км²",
    "Палау": "459 км²",
    "Палестина": "6,220 км²",
    "Панама": "75,517 км²",
    "Папуа — Новая Гвинея": "462,840 км²",
    "Парагвай": "406,752 км²",
    "Перу": "'1,285,216 км²",
    "Польша": "312,679 км²",
    "Португалия": "92,212 км²",
    "Пуэрто-Рико": "9,104 км²",
    "Южная Корея": "219,140 км²",
    "Реюньон": "2,512 км²",
    "Россия": "17,098,242 км²",
    "Руанда": "26,338 км²",
    "Румыния": "238,391 км²",
    "Сальвадор": "21,045 км²",
    "Самоа": "2,831 км²",
    "Сан-Марино": "61, 2 км²",
    "Сан-Томе и Принсипи": "1,001 км²",
    "Саудовская Аравия": "2,149,690 км²",
    "Свазиленд": "17,364 км²",
    "Северная Корея": "120,540 км²",
    "Сейшелы": "455 км²",
    "Сенегал": "196,712 км²",
    "Сент-Винсент и Гренадины": "389 км²",
    "Сент-Китс и Невис": "261 км²",
    "Сент-Люсия": "617 км²",
    "Сербия": "88,361 км²",
    "Сингапур": "728,6 км²",
    "Сирия": "185,180 км²",
    "Словакия": "49,035 км²",
    "Словения": "20,273 км²",
    "Соломоновы Острова": "28,400 км²",
    "Сомали": "637,657 км²",
    "Судан": "1,886,068 км²",
    "Суринам": "163,821 км²",
    "США": "9,147,593 км²",
    "Сьерра-Леоне": "71,740 км²",
    "Таджикистан": "143,100 км²",
    "Таиланд": "513,120 км²",
    "Тайвань": "36,193 км²",
    "Танзания": "947,303 км²",
    "Того": "56,785 км²",
    "Тонга": "748,5 км²",
    "Тринидад и Тобаго": "5,131 км²",
    "Тувалу": "26 км²",
    "Тунис": "163,610 км²",
    "Туркменистан": "491,210 км²",
    "Турция": "783,562 км²",
    "Уганда": "241,038 км²",
    "Узбекистан": "448 978 км²",
    "Украина": "603,500 км²",
    "Уругвай": "176,215 км²",
    "Фиджи": "18,274 км²",
    "Филиппины": "300,000 км²",
    "Финляндия": "338,424 км²",
    "Франция": "640,679 км²",
    "Французская Гвиана": "83,846 км²",
    "Французская Полинезия": "4,167 км²",
    "Хорватия": "56,594 км²",
    "ЦАР": "622,984 км²",
    "Чад": "1,284,000 км²",
    "Черногория": "13,812 км²",
    "Чехия": "78,866 км²",
    "Чили": "756,096 км²",
    "Швейцария": "41,285 км²",
    "Швеция": "450,295 км²",
    "Шри-Ланка": "65,610 км²",
    "Эквадор": "283,560 км²",
    "Экваториальная Гвинея": "245,836 км²",
    "Эритрея": "117,600 км²",
    "Эсватини": "17,364 км²",
    "Эстония": "45,227 км²",
    "Эфиопия": "1,104,300 км²",
    "ЮАР": "1,221,037 км²",
    "Южный Судан": "619,745 км²",
    "Ямайка": "10,991 км²",
    "Япония": "377,944 км²"
};

document.querySelectorAll(".allPaths").forEach(e => {
    e.addEventListener("mouseover", async function () {
        e.style.cursor = 'pointer';
        e.style.fill = '#00ff95';
        let ans = area[e.id];
        document.getElementById('try').innerHTML = `${e.id} <br> Площадь: ${ans}`;
        // let ans = vvp[e.id];
        // document.getElementById('country').innerHTML = ans;
    })

    e.addEventListener("mouseleave", function () {
        e.style.fill = "#009dc4";
        e.style.cursor = "default";
    })
})





let svg = document.querySelector("#svg");
let viewport = document.querySelector("#viewport");
let point = svg.createSVGPoint();
let viewBox = svg.viewBox.baseVal;



let zoom = {
  animation: new TimelineLite(),
  scaleFactor: 1.6,
  duration: 0.5,
  ease: Power2.easeOut,
};



window.addEventListener("wheel", onWheel);


//
// ON WHEEL
// =========================================================================== 
function onWheel(event) {
  event.preventDefault();
  

  
  let normalized;  
  let delta = event.wheelDelta;

  if (delta) {
    normalized = (delta % 120) == 0 ? delta / 120 : delta / 12;
  } else {
    delta = event.deltaY || event.detail || 0;
    normalized = -(delta % 3 ? delta * 10 : delta / 3);
  }
  
  let scaleDelta = normalized > 0 ? 1 / zoom.scaleFactor : zoom.scaleFactor;
  
  point.x = event.clientX;
  point.y = event.clientY;
  
  let startPoint = point.matrixTransform(svg.getScreenCTM().inverse());
    
  let fromlets = {
    ease: zoom.ease,
    x: viewBox.x,
    y: viewBox.y,
    width: viewBox.width,
    height: viewBox.height,
  };
  
  viewBox.x -= (startPoint.x - viewBox.x) * (scaleDelta - 1);
  viewBox.y -= (startPoint.y - viewBox.y) * (scaleDelta - 1);
  viewBox.width *= scaleDelta;
  viewBox.height *= scaleDelta;
    
  zoom.animation = TweenLite.from(viewBox, zoom.duration, fromlets);  
}
