let area= {
    "Австралия": ["7,692,024 км²", 13, 6, 0.6],
      "Австрия": ["83,879 км²", 10, 9, 0.0],
      "Азербайджан": ["86,600 км²", 14, 6, 0.8],
      "Албания": ["28,748 км²", 10, 8, 0.2],
      "Алжир": ["2,381,741 км²", 24, 5, 2.0],
      "Ангола": ["1,246,700 км²", 44, 9, 3.5],
      "Андорра": ["467,6 км²", 7, 4, 0.3],
      "Антигуа и Барбуда": ["440 км²", 11, 6, 0.4],
      "Аргентина": ["2,780,400 км²", 17, 8, 0.9],
      "Армения": ["29,743 км²", 12, 9, 0.3],
      "Афганистан": ["652,864 км²", 33, 6, 2.7],
      "Багамские Острова": ["13,878 км²", 14, 7, 0.7],
      "Бангладеш": ["147,570 км²", 21, 5, 1.6],
      "Барбадос": ["430 км²", 11, 9, 0.2],
      "Бахрейн": ["760 км²", 14, 2, 1.2],
      "Беларусь": ["207,595 км²", 9, 13, -0.4],
      "Белиз": ["22,966 км²", 20, 5, 1.5],
      "Бельгия": ["30,528 км²", 10, 10, 0.1],
      "Бенин": ["114,763 км²", 42, 9, 3.3],
      "Болгария": ["110,994 км²", 9, 16, -0.7],
      "Боливия": ["1,098,581 км²", 22, 6, 1.6],
      "Босния и Герцеговина": ["51,197 км²", 8, 11, -0.3],
      "Ботсвана": ["581,730 км²", 21, 9, 1.2],
      "Бразилия": ["8,515,767 км²", 14, 6, 0.8],
      "Бруней": ["5,765 км²", 14, 4, 1.0],
      "Буркина-Фасо": ["274,200 км²", 38, 8, 3.0],
      "Бурунди": ["27,834 км²", 37, 6, 3.1],
      "Бутан": ["38,394 км²", 16, 7, 0.9],
      "Вануату": ["12,190 км²", 29, 4, 2.5],
      "Великобритания": ["243,610 км²", 11, 9, 0.2],
      "Венгрия": ["93,030 км²", 9, 13, -0.4],
      "Венесуэла": ["916,445 км²", 18, 7, 1.1],
      "Восточная Сахара": ["266,000 км²"],
      "Восточный Тимор": ["15,007 км²", 30, 6, 2.4],
      "Вьетнам": ["332,698 км²", 16, 6, 1.0],
      "Габон": ["267,667 км²", 26, 6, 2.0],
      "Гваделупа": ["1628 км²", 11, 9, 0.2],
      "Гаити": ["27,750 км²", 24, 8, 1.6],
      "Гайана": ["214,970 км²", 20, 8, 1.2],
      "Гамбия": ["10,689 км²", 33, 8, 2.5],
      "Гана": ["238,535 км²", 30, 7, 2.3],
      "Гватемала": ["108,889 км²", 22, 5, 1.7],
      "Гвинея": ["245,836 км²", 38, 10, 2.8],
      "Гвинея-Бисау": ["36,125 км²", 37, 8, 2.9],
      "Германия": ["357,168 км²", 10, 12, -0.2],
      "Гондурас": ["112,492 км²", 19, 5, 1.4],
      "Гренада": ["344 км²", 16, 10, 0.6],
      "Гренландия": ["2,166,086 км²"],
      "Греция": ["131,957 км²", 8, 11, -0.3],
      "Грузия": ["69,700 км²", 13, 13, 0.0],
      "Дания": ["42,915 км²", 11, 9, 0.1],
      "Джибути": ["23,200 км²", 21, 7, 1.4],
      "Доминика": ["750 км²", 10, 10, 0.0],
      "Доминиканская Республика": ["48,442 км²", 19, 6, 1.3],
      "Египет": ["1,002,450 км²", 23, 6, 1.8],
      "Замбия": ["752,618 км²", 37, 6, 3.1],
      "Зимбабве": ["390,757 км²", 33, 8, 2.5],
      "Израиль": ["20,770 км²", 20, 5, 1.5],
      "Индия": ["3,287,590 км²", 20, 6, 1.4],
      "Индонезия": ["1,904,569 км²", 18, 7, 1.2],
      "Иордания": ["89,342 км²", 22, 4, 1.8],
      "Ирак": ["437,072 км²", 27, 4, 2.3],
      "Иран": ["1,648,195 км²", 17, 5, 1.2],
      "Ирландия": ["84,421 км²", 12, 6, 0.6],
      "Исландия": ["102,775 км²", 12, 6, 0.5],
      "Испания": ["504,645 км²", 8, 9, -0.1],
      "Италия": ["301,338 км²", 7, 11, -0.4],
      "Йемен": ["527,829 км²", 30, 6, 2.4],
      "Кабо-Верде": ["4,033 км²"],
      "Казахстан": ["2,724,900 км²", 21, 7, 1.4],
      "Камбоджа": ["181,035 км²", 22, 6, 1.6],
      "Камерун": ["475,442 км²", 38, 8, 3.0],
      "Канада": ["9,984,670 км²", 10, 8, 0.2],
      "Катар": ["11,571 км²", 10, 1, 0.9],
      "Кения": ["581,309 км²", 28, 5, 2.3],
      "Кипр": ["9,251 км²", 11, 7, 0.4],
      "Киргизия": ["199,951 км²", 27, 5, 2.2],
      "Кирибати": ["811 км²", 26, 7, 1.9],
      "Китай": ["9,596,961 км²", 10, 7, 0.3],
      "Колумбия": ["1,141,748 км²", 13, 5, 0.9],
      "Коморы": ["2,235 км²", 32, 7, 2.5],
      "Конго": ["342,000 км²", 33, 7, 2.6],
      "Демократическая Республика Конго": ["2,345,409 км²", 44, 9, 3.5],
      "Коста-Рика": ["51,100 км²", 13, 5, 0.8],
      "Кот-д'Ивуар": ["322,463 км²", 35, 10, 2.5],
      "Куба": ["109,884 км²", 10, 10, 0.1],
      "Кувейт": ["17,820 км²", 14, 2, 1.2],
      "Лаос": ["236,800 км²", 23, 7, 1.6],
      "Латвия": ["64,589 км²", 10, 154, -0.5],
      "Лесото": ["30,355 км²", 23, 14, 0.9],
      "Либерия": ["111,369 км²", 33, 7, 2.6],
      "Ливан": ["10,452 км²", 17, 5, 1.2],
    "Ливия": ["1,759,541 км²", 24, 4, 2.0],
    "Литва": ["65,300 км²", 10, 14, -0.4],
    "Лихтенштейн": ["158 км²", 10, 7, 0.3],
    "Люксембург": ["2,586 км²", 10, 7, 0.3],
    "Маврикий": ["2,040 км²", 10, 9, 0.1],
    "Мавритания": ["1,030,700 км²", 34, 7, 2.7],
    "Мадагаскар": ["587,041 км²", 37, 6, 3.1],
    "Македония": ["25,713 км²", 10, 10, 0.1],
    "Малави": ["118,484 км²", 34, 7, 2.7],
    "Малайзия": ["329,847 км²", 16, 5, 1.0],
    "Мали": ["1,240,192 км²", 46, 10, 3.6],
    "Мальдивы": ["297,8 км²", 19, 4, 1.5],
    "Мальта": ["316 км²", 9, 8, 0.2],
    "Марокко": ["446 550 км²", 17, 5, 1.2],
    "Мартиника": ["1,128 км²", 10, 9, 0.1],
    "Маршалловы Острова": ["181 км²", 25, 4, 2.1],
    "Мексика": ["1,972,550 км²", 17, 6, 1.2],
    "Микронезия": ["702 км²", 24, 5, 1.8],
    "Мозамбик": ["801,590 км²", 39, 11, 2.8],
    "Молдова": ["33,846 км²", 9, 10, -0.1],
    "Монако": ["2,02 км²", 6, 7, -0.1],
    "Монголия": ["1,564,116 км²", 25, 6, 1.9],
    "Мьянма": ["676,578 км²", 18, 8, 1.0],
    "Намибия": ["825,615 км²", 28, 8, 2.0],
    "Науру": ["21 км²", 29, 8, 2.1],
    "Непал": ["147,181 км²", 21, 7, 1.4],
    "Нигер": ["1,267,000 км²", 48, 10, 3.8],
    "Нигерия": ["923,768 км²", 37, 12, 2.5],
    "Нидерланды": ["41,543 км²", 10, 9, 0.1],
    "Никарагуа": ["130,375 км²", 21, 4, 1.8],
    "Ниуэ": ["261,5 км²"],
    "Новая Зеландия": ["268,021 км²", 12, 7, 0.5],
    "Новая Каледония": ["18,576 км²", 17, 6, 1.1],
    "Норвегия": ["385,178 км²", 10, 8, 0.3],
    "ОАЭ": ["83,600 км²", 11, 1, 1.0],
    "Оман": ["309,501 км²", 21, 2, 1.9],
    "Пакистан": ["803,940 км²", 28, 6, 2.2],
    "Палау": ["459 км²", 14, 9, 0.5],
    "Палестина": ["6,220 км²"],
    "Панама": ["75,517 км²", 19, 5, 1.4],
    "Папуа — Новая Гвинея": ["462,840 км²", 32, 11, 2.1],
    "Парагвай": ["406,752 км²", 21, 6, 1.5],
    "Перу": ["1,285,216 км²", 19, 5, 1.4],
    "Польша": ["312,679 км²", 10, 11, -0.1],
    "Португалия": ["92,212 км²", 9, 11, -0.3],
    "Пуэрто-Рико": ["9,104 км²", 7, 9, -0.2],
    "Южная Корея": ["219,140 км²", 6, 6, 0],
    "Реюньон": ["2,512 км²", 15, 6, 1.0],
    "Россия": ["17,098,242 км²", 11, 13, -0.2],
    "Руанда": ["26,338 км²", 32, 5, 2.7],
    "Румыния": ["238,391 км²", 11, 14, -0.3],
    "Сальвадор": ["21,045 км²", 19, 6, 1.3],
    "Самоа": ["2,831 км²", 27, 5, 2.2],
    "Сан-Марино": ["61,2 км²", 7, 7, -0.1],
    "Сан-Томе и Принсипи": ["1,001 км²", 26, 6, 2.0],
    "Саудовская Аравия": ["2,149,690 км²", 15, 3, 1.2],
    "Свазиленд": ["17,364 км²"],
    "Северная Корея": ["120,540 км²", 14, 9, 0.5],
    "Сейшелы": ["455 км²", 16, 8, 0.8],
    "Сенегал": ["196,712 км²", 34, 6, 2.8],
    "Сент-Винсент и Гренадины": ["389 км²", 14, 9, 0.5],
    "Сент-Китс и Невис": ["261 км²", 13, 7, 0.6],
    "Сент-Люсия": ["617 км²", 12, 7, 0.5],
    "Сербия": ["88,361 км²", 9, 15, -0.5],
    "Сингапур": ["728,6 км²", 9, 5, 0.4],
    "Сирия": ["185,180 км²", 24, 5, 1.9],
    "Словакия": ["49,035 км²", 10, 10, 0.1],
    "Словения": ["20,273 км²", 10, 10, 0.0],
    "Соломоновы Острова": ["28,400 км²", 30, 5, 2.5],
    "Сомали": ["637,657 км²", 42, 11, 3.1],
    "Судан": ["1,886,068 км²", 32, 7, 2.5],
    "Суринам": ["163,821 км²", 17, 6, 1.0],
    "США": ["9,147,593 км²", 12, 9, 0.3],
    "Сьерра-Леоне": ["71,740 км²", 33, 12, 2.1],
    "Таджикистан": ["143,100 км²", 25, 4, 2.2],
    "Таиланд": ["513,120 км²", 10, 8, 0.2],
    "Тайвань": ["36,193 км²", 8, 7, 0.0],
    "Танзания": ["947,303 км²", 37, 6, 3.1],
    "Того": ["56,785 км²", 35, 8, 2.7],
    "Тонга": ["748,5 км²", 24, 7, 1.7],
    "Тринидад и Тобаго": ["5,131 км²", 13, 9, 0.4],
    "Тувалу": ["26 км²", 25, 9, 1.6],
    "Тунис": ["163,610 км²", 17, 6, 1.1],
    "Туркменистан": ["491,210 км²", 23, 7, 1.6],
    "Турция": ["783,562 км²", 18, 5, 1.2],
    "Уганда": ["241,038 км²", 39, 6, 3.3],
    "Узбекистан": ["448 978 км²", 23, 5, 1.9],
    "Украина": ["603,500 км²", 8, 14, -0.6],
    "Уругвай": ["176,215 км²", 13, 9, 0.4],
    "Фиджи": ["18,274 км²", 18, 8, 1.0],
    "Филиппины": ["300,000 км²", 22, 6, 1.6],
    "Финляндия": ["338,424 км²", 8, 10, -0.2],
    "Франция": ["640,679 км²", 11, 9, 0.2],
    "Французская Гвиана": ["83,846 км²", 27, 4, 2.4],
    "Французская Полинезия": ["4,167 км²", 15, 6, 1.0],
    "Хорватия": ["56,594 км²", 9, 13, -0.4],
    "ЦАР": ["622,984 км²", 35, 12, 2.3],
    "Чад": ["1,284,000 км²", 43, 11, 3.2],
    "Черногория": ["13,812 км²", 12, 11, 0.1],
    "Чехия": ["78,866 км²", 11, 11, 0.0],
    "Чили": ["756,096 км²", 12, 6, 0.6],
    "Швейцария": ["41,285 км²", 10, 8, 0.2],
    "Швеция": ["450,295 км²", 11, 9, 0.3],
    "Шри-Ланка": ["65,610 км²", 15, 6, 0.9],
    "Эквадор": ["283,560 км²", 17, 4, 1.3],
    "Экваториальная Гвинея": ["245,836 км²", 33, 9, 2.4],
    "Эритрея": ["117,600 км²", 30, 7, 2.3],
    "Эсватини": ["17,364 км²", 25, 10, 1.5],
    "Эстония": ["45,227 км²", 11, 12, -0.1],
    "Эфиопия": ["1,104,300 км²", 33, 6, 2.7],
    "ЮАР": ["1,221,037 км²", 20, 9, 1.1],
    "Южный Судан": ["619,745 км²", 35, 10, 2.5],
    "Ямайка": ["10,991 км²", 16, 8, 0.8],
    "Япония": ["377,944 км²", 7, 11, -0.4],
    "Фарерские острова": ["95 км²"],
    "Фолклендские острова": ["12,173 км²"],
    "Косово": ["10,887 км²", 12, 5, 0.7]

};


document.querySelectorAll(".allPaths").forEach(e => {
    e.addEventListener("mouseover", async function () {
        e.style.cursor = 'pointer';
        e.style.fill = '#00ff95';
        if(area[e.id].length === 4) {
          let ans = area[e.id][0];
          let br = area[e.id][1];
          let death = area[e.id][2];
          let ep = area[e.id][3];
          document.getElementById('try').innerHTML = `${e.id} <br> Площадь: ${ans} <br> Рождаемость: ${br} <br> Смертность: ${death} <br> Естественный прирост: ${ep} <br> (на тыс. жителей)`;
        } else {
          document.getElementById('try').innerHTML = `${e.id} <br> Площадь: ${area[e.id][0]} <br> Рождаемость: Нет данных <br> Смертность: Нет данных <br> Естественный прирост: Нет данных <br> (на тыс. жителей)`;
        }
       
        // let ans = vvp[e.id];
        // document.getElementById('country').innerHTML = ans;
    })

    e.addEventListener("mouseleave", function () {
        e.style.fill = "#009dc4";
        e.style.cursor = "default";
    })
})




let trry = document.getElementById('try');
let svg = document.querySelector("#svg");
let viewport = document.querySelector("#viewport");
let point = svg.createSVGPoint();
let viewBox = svg.viewBox.baseVal;



let zoom = {
  animation: new TimelineLite(),
  scaleFactor: 1.6,
  duration: 0.5,
  ease: Power2.easeOut,
};



window.addEventListener("wheel", onWheel);


//
// ON WHEEL
// =========================================================================== 
function onWheel(event) {
  event.preventDefault();
  

  
  let normalized;  
  let delta = event.wheelDelta;

  if (delta) {
    normalized = (delta % 120) == 0 ? delta / 120 : delta / 12;
  } else {
    delta = event.deltaY || event.detail || 0;
    normalized = -(delta % 3 ? delta * 10 : delta / 3);
  }
  
  let scaleDelta = normalized > 0 ? 1 / zoom.scaleFactor : zoom.scaleFactor;
  
  point.x = event.clientX;
  point.y = event.clientY;
  
  let startPoint = point.matrixTransform(svg.getScreenCTM().inverse());
    
  let fromlets = {
    ease: zoom.ease,
    x: viewBox.x,
    y: viewBox.y,
    width: viewBox.width,
    height: viewBox.height,
  };
  
  viewBox.x -= (startPoint.x - viewBox.x) * (scaleDelta - 1);
  viewBox.y -= (startPoint.y - viewBox.y) * (scaleDelta - 1);
  viewBox.width *= scaleDelta;
  viewBox.height *= scaleDelta;
    
  zoom.animation = TweenLite.from(viewBox, zoom.duration, fromlets);  
}

trry.addEventListener("click", resetViewport);


    let cachedViewBox = {
        x: viewBox.x,
        y: viewBox.y,
        width: viewBox.width,
        height: viewBox.height
    };

    function resetViewport() {
        let resetAnimation = new TimelineLite();

        let duration = 0;
        let ease = Power3.easeOut;
        
        resetAnimation.clear()
        .to(viewBox, duration, {
            x: cachedViewBox.x,
            y: cachedViewBox.y,
            width: cachedViewBox.width,
            height: cachedViewBox.height,
            ease: ease
        }, 0)
        .to(viewport, duration, {
            attr: { transform: "matrix(1,0,0,1,0,0)" },
            // rotation: "0_short",
            smoothOrigin: false,
            svgOrigin: "0 0",
            ease: ease
        }, 0)
    }
